#extract_alarms_task.py中使用的告警代码
ALARM_CODES = {40, 41, 42, 43, 44, 45, 46, 47, 70, 71, 72, 74, 110, 111, 112, 114, 150, 162, 164, 176, 190, 240, 252, 254, 266, 280, 330, 342, 344, 356, 370, 420, 432, 434, 446, 460}

#告警含义
ALARM_MEANINGS = {
    0: "设备网管连接中断",
    40: "1方向电源板A状态",
    41: "1方向电源板B状态",
    42: "2方向电源板A状态",
    43: "2方向电源板B状态",
    44: "1方向CPU板A通信状态",
    45: "1方向CPU板B通信状态",
    46: "2方向CPU板A通信状态",
    47: "2方向CPU板B通信状态",
    70: "提醒：1方向QHJ状态与邻站不同",
    71: "1方向电缆状态",
    72: "提醒：1方向切换模式与邻站不同",
    74: "接口箱1方向切换板故障",
    110: "提醒：2方向QHJ状态与邻站不同",
    111: "2方向电缆状态",
    112: "提醒：2方向切换模式与邻站不同",
    114: "接口箱2方向切换板故障",
    150: "邻站未正确输出（一方向CPU1）",
    162: "站间A通道或通信板故障（一方向A系）",
    164: "站间B通道或通信板故障（一方向A系）",
    176: "驱动模块故障（一方向CPU1）",
    190: "CPU板离线（一方向A系）",
    240: "邻站未正确输出（一方向CPU2）",
    252: "站间A通道或通信板故障（一方向B系）",
    254: "站间B通道或通信板故障（一方向B系）",
    266: "驱动模块故障（一方向CPU2）",
    280: "CPU板离线（一方向B系）",
    330: "邻站未正确输出（二方向CPU1）",
    342: "站间A通道或通信板故障（二方向A系）",
    344: "站间B通道或通信板故障（二方向A系）",
    356: "驱动模块故障（二方向CPU1）",
    370: "CPU板离线（二方向A系）",
    420: "邻站未正确输出（二方向CPU2）",
    432: "站间A通道或通信板故障（二方向B系）",
    434: "站间B通道或通信板故障（二方向B系）",
    446: "驱动模块故障（二方向CPU2）",
    460: "CPU板离线（二方向B系）",
}

# 通信超时参数（秒）(0号告警延时参数)
COMMUNICATION_TIMEOUT = 60

# 告警延时参数（秒）
ALARM_DELAY = {
    40: 5, 41: 5, 42: 5, 43: 5, 44: 5, 45: 5, 46: 5, 47: 5,
    70: 60, 110: 60,
    71: 600, 111: 600,
    72: 15, 112: 15, 
    74: 5,  114: 5,
    162: 5, 164: 5, 252: 5, 254: 5, 342: 5, 344: 5, 432: 5, 434: 5,
    176: 5, 266: 5, 356: 5, 446: 5,
    150: 5, 240: 5, 330: 5, 420: 5, 
    190: 5, 280: 5, 370: 5, 460: 5,   
}


#udp_receiver.py中使用的参数
LAST_COMMUNICATION_TIME_TIMEOUT = 3600  # 最后通信时间缓存时长，影响到设备离线告警持续时长
SWITCH_DATA_TIMEOUT = 60  # 开关量数据缓存 60 秒，即使数据包内容不变也每分钟发一次数据包给 Celery 避免意外故障
HEARTBEAT_TIMEOUT = 60 # 收到的数据包作为心跳包，如果超过就重启本程序
PERIODIC_DEVICE_CACHE_REFRESH_INTERVAL= 10 #周期性设备刷新时间间隔（秒）生产环境可以设置为60秒
